## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,116 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.resource_group.azurerm_resource_group.default[0] will be created
+  + resource "azurerm_resource_group" "default" {
+      + id       = (known after apply)
+      + location = "northeurope"
+      + name     = "rg-app-test-neu"
+      + tags     = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app-test-neu"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-resource-group"
+        }
+
+      + timeouts {
+          + create = "90m"
+          + delete = "90m"
+          + read   = "5m"
+          + update = "90m"
+        }
+    }
+
+  # module.subnets.azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
+  + resource "azurerm_subnet" "subnet" {
+      + address_prefixes                              = [
+          + "10.0.2.0/24",
+        ]
+      + default_outbound_access_enabled               = true
+      + id                                            = (known after apply)
+      + name                                          = "AzureFirewallSubnet"
+      + private_endpoint_network_policies             = "Enabled"
+      + private_link_service_network_policies_enabled = true
+      + resource_group_name                           = "rg-app-test-neu"
+      + virtual_network_name                          = "vnet-app-test-neu"
+    }
+
+  # module.subnets.azurerm_subnet.subnet["subnet1"] will be created
+  + resource "azurerm_subnet" "subnet" {
+      + address_prefixes                              = [
+          + "10.0.1.0/24",
+        ]
+      + default_outbound_access_enabled               = true
+      + id                                            = (known after apply)
+      + name                                          = "subnet1"
+      + private_endpoint_network_policies             = "Enabled"
+      + private_link_service_network_policies_enabled = true
+      + resource_group_name                           = "rg-app-test-neu"
+      + service_endpoints                             = [
+          + "Microsoft.Storage",
+        ]
+      + virtual_network_name                          = "vnet-app-test-neu"
+
+      + delegation {
+          + name = "delegation1"
+
+          + service_delegation {
+              + actions = [
+                  + "Microsoft.Network/virtualNetworks/subnets/action",
+                ]
+              + name    = "Microsoft.ContainerInstance/containerGroups"
+            }
+        }
+    }
+
+  # module.vnet.azurerm_virtual_network.vnet[0] will be created
+  + resource "azurerm_virtual_network" "vnet" {
+      + address_space                  = [
+          + "10.0.0.0/16",
+        ]
+      + dns_servers                    = []
+      + guid                           = (known after apply)
+      + id                             = (known after apply)
+      + location                       = "northeurope"
+      + name                           = "vnet-app-test-neu"
+      + private_endpoint_vnet_policies = "Disabled"
+      + resource_group_name            = "rg-app-test-neu"
+      + subnet                         = (known after apply)
+      + tags                           = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "test"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "app-test-neu"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-vnet"
+        }
+    }
+
+Plan: 4 to add, 0 to change, 0 to destroy.
+
+Changes to Outputs:
+  + resource_group_location = "northeurope"
+  + resource_group_name     = "rg-app-test-neu"
+  + subnet_ids              = {
+      + AzureFirewallSubnet = (known after apply)
+      + subnet1             = (known after apply)
+    }
+  + tags                    = {
+      + Business_unit   = "corp"
+      + Deployment_mode = "terraform"
+      + Environment     = "test"
+      + Managedby       = "terraform-az-modules"
+      + Name            = "app-test-neu"
+      + Repository      = "https://github.com/terraform-az-modules/terraform-azure-subnet.git"
+    }
+  + vnet_address_space      = [
+      + "10.0.0.0/16",
+    ]
+  + vnet_id                 = (known after apply)
+  + vnet_name               = "vnet-app-test-neu"

```

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-subnet/actions/runs/15474983543)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->